jetpax/ArduinoCore-zephyr/boards.txt
nano_matter.upload.tool=openocd
nano_matter.upload.tool.default=openocd
nano_matter.upload.config=-f target/efm32s2_g23.cfg
nano_matter.upload.programmer=-f interface/cmsis-dap.cfg
nano_matter.upload.protocol=SWD
nano_matter.upload.setup_command=
nano_matter.upload.use_1200bps_touch=false
nano_matter.upload.wait_for_upload_port=false
nano_matter.upload.native_usb=false

nano_matter.bootloader.tool=openocd
nano_matter.bootloader.tool.default=openocd
nano_matter.bootloader.vid=0x2341
nano_matter.bootloader.pid=0x0072
nano_matter.bootloader.interface=0
nano_matter.bootloader.file=zephyr-{build.variant}.hex
nano_matter.bootloader.target=arduino_nano_matter

nano_matter.debug.server=openocd
nano_matter.debug.server.openocd.scripts.0=interface/cmsis-dap.cfg
nano_matter.debug.server.openocd.scripts.1=target/efm32s2_g23.cfg
nano_matter.debug.cortex-debug.custom.postAttachCommands.0=monitor reset halt
#nano_matter.debug.cortex-debug.custom.postAttachCommands.1=monitor reset_config srst_nogate
#nano_matter.debug.cortex-debug.custom.postAttachCommands.2=monitor gdb_breakpoint_override hard
nano_matter.debug.cortex-debug.custom.postAttachCommands.3=monitor gdb_sync
nano_matter.debug.cortex-debug.custom.postAttachCommands.4=c
nano_matter.debug.cortex-debug.custom.overrideRestartCommands.0=monitor reset halt
nano_matter.debug.cortex-debug.custom.overrideRestartCommands.1=monitor gdb_sync
nano_matter.debug.cortex-debug.custom.overrideRestartCommands.2=c
nano_matter.debug.cortex-debug.custom.request=attach

##############################################################################################################

unoq.name=Arduino UNO Q
unoq.build.core=arduino
unoq.build.crossprefix=arm-zephyr-eabi-
unoq.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/

unoq.menu.link_mode.dynamic=Dynamic
unoq.menu.link_mode.static=Static
unoq.menu.link_mode.static.build.link_mode=static
unoq.menu.link_mode.static.upload.extension=bin-zsk.bin

unoq.menu.wait_linux_boot.yes=Wait for Linux
unoq.menu.wait_linux_boot.no=Immediate
unoq.menu.wait_linux_boot.no.build.boot_mode=immediate
unoq.menu.wait_linux_boot.app=Wait for App
unoq.menu.wait_linux_boot.app.build.boot_mode=app

unoq.build.zephyr_target=arduino_uno_q
unoq.build.zephyr_args=
unoq.build.variant=arduino_uno_q_stm32u585xx
unoq.build.artifact=zephyr_unoq
unoq.build.subarch=zephyr

unoq.openocd_cfg=flash_sketch.cfg
unoq.build.extra_flags=
unoq.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
unoq.build.board=UNO_Q
unoq.build.zephyr_hals=hal_stm32
unoq.build.zephyr_toolchain=arm-zephyr-eabi
unoq.vid.0=0x2341
unoq.pid.0=0x0078
unoq.upload_port.0.vid=0x2341
unoq.upload_port.0.pid=0x0078
unoq.upload.target=stm32u585zitxq

unoq.upload.tool=remoteocd
unoq.upload.tool.default=remoteocd
unoq.upload.tool.network=remoteocd_network
unoq.upload.protocol=
unoq.upload.transport=
unoq.upload.vid=0x2341
unoq.upload.pid=0x0078
unoq.upload.interface=0
unoq.upload.use_1200bps_touch=false
unoq.upload.wait_for_upload_port=false
unoq.upload.native_usb=true

unoq.bootloader.tool=remoteocd
unoq.bootloader.tool.default=remoteocd
unoq.bootloader.file=zephyr-{build.variant}.elf
unoq.bootloader.target=stm32u585zitxq

##############################################################################################################

# PiZZA -- Raspberry Pi Zero 2 W (BCM2710A1, Cortex-A53, aarch64).
# Out-of-tree variant. Sketches load as llext from a FAT file on the
# SD card; the "loader" firmware is the kernel image written to the
# SD boot partition. See notes/pizza-arduino-phase0.md.
pizza.name=PiZZA (Raspberry Pi Zero 2 W)
pizza.build.core=arduino
pizza.build.crossprefix=aarch64-zephyr-elf-
# Until the aarch64-zephyr-elf toolchain ships as an Arduino-packaged tool,
# the developer needs a symlink at
#   ~/Library/Arduino15/packages/arduino-git/tools/aarch64-zephyr-elf/0.17.0
# pointing to their local Zephyr SDK (`~/zephyr-sdk/aarch64-zephyr-elf`).
pizza.build.compiler_path={runtime.tools.aarch64-zephyr-elf-0.17.0.path}/bin/

# Override platform.txt's link_command to drop --specs=nano.specs /nosys.specs:
# the aarch64-zephyr-elf toolchain ships picolibc (not newlib-nano), so those
# spec files don't exist. The relocatable-ELF link doesn't need picolibc.specs
# either -- nothing needs the startup-file or syscall stubs at link time.
pizza.build.link_command="{compiler.path}{compiler.c.elf.cmd}" "-L{build.path}" "-L{build.variant.path}" {compiler.c.elf.flags} {compiler.c.elf.extra_flags} {build.extra_flags} {build.extra_ldflags} {compiler.zephyr.common_ldflags} {compiler.ldflags} {object_files} -Wl,--start-group "{build.path}/{archive_file}" {compiler.zephyr.extra_ldflags} {compiler.libraries.ldflags} -Wl,--end-group {build.link_args.{build.link_mode}}

pizza.build.zephyr_target=rpi_zero_2w/bcm2710
pizza.build.zephyr_args=-DTOOLCHAIN_HAS_GLIBCXX=ON
pizza.build.zephyr_hals=hal_broadcom
pizza.build.variant=rpi_zero_2w_bcm2710
pizza.build.artifact=pizza
pizza.build.board=PIZZA
pizza.build.zephyr_toolchain=aarch64-zephyr-elf

# IDE machine fields -- previously emitted into the auto-generated boards.local.txt
# at package time; kept in source so they survive dist-build (which regenerates
# boards.local.txt header-only). mcu = IDE display/recipe hint; maximum_data_size
# = the IDE RAM-usage cap (1 MiB, the loader's llext heap).
pizza.build.mcu=cortex-a53
pizza.upload.maximum_data_size=1048576

# No USB DFU on this target -- the Pi boots from SD. The sketch is the raw
# relocatable ELF (not the upstream Arduino header-wrapped variant), since
# the PiZZA loader's fs_loader path consumes a stock ELF/llext file directly.
pizza.upload.extension=elf

# Skip the zephyr-sketch-tool header-wrap hooks -- the relocatable ELF
# produced by the linker IS our final .llext, no header needed.
pizza.recipe.hooks.objcopy.postobjcopy.1.pattern=
pizza.recipe.hooks.objcopy.postobjcopy.2.pattern=

# Skip the zephyr-check-size step -- PiZZA sketches live on SD-FAT with no
# fixed flash-partition size limit. (The default tool reads bounds from a
# .config file we'd otherwise have to maintain.)
pizza.recipe.size.pattern=

